## アカウント作成テスト  ##
# １、アカウント作成画面アクセス
# ２、アカウント入力フォームの入力。登録ボタンのクリック
# ３、アカウント詳細画面に遷移
# ４、作成したアカウントが表示されているかを確認（Emailが一致すればOK）
# 

##　　アカウント作成テストここまで　　##


##  アカウント一覧テスト  ###
# 
# １、前提条件で一般ユーザを作成しておく。（ログインはしない）
# ２、ログイン画面にアクセス
# ３、管理者ユーザでログイン
# ４、タスク一覧画面に遷移後に、アカウント一覧ページに遷移
# ５、１で作成した一般ユーザが存在しているかを確認
# ６、一般ユーザでログイン（作成し、ログイン）
# ７、アカウント一覧画面に遷移できないことを確認。
# ８、遷移できないことが確認できたらTrue 
# 　一般ユーザがユーザ一覧見られないことをテストするのは無理では…？５まででいい気がする…

##　　アカウント一覧テストここまで　　##


## アカウント詳細テスト  ##

# 

##　　アカウント詳細テストここまで　　##


## アカウント編集テスト  ##

# 

##　　アカウント編集テストここまで　　##


## アカウント検索テスト  ##
# 一覧の中に入れるべきか？
# 

##　アカウント検索テストここまで　　##